apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
#include "app_nus_server.h"
#include "app_nus_client.h"
#include "app_timer.h"
#include "app_uart.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_nus.h"
#include "bsp_btn_ble.h"
#include "calendar.h"
#include "fds.h"
#include "filesystem.h"
#include "nrf.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_delay.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "variables.h"

#define APP_BLE_CONN_CFG_TAG 1
#define DEVICE_NAME "Repetidor"
#define NUS_SERVICE_UUID_TYPE BLE_UUID_TYPE_VENDOR_BEGIN
#define APP_BLE_OBSERVER_PRIO 3
#define APP_ADV_INTERVAL 64
#define APP_ADV_DURATION 18000
#define MIN_CONN_INTERVAL MSEC_TO_UNITS(20, UNIT_1_25_MS)
#define MAX_CONN_INTERVAL MSEC_TO_UNITS(75, UNIT_1_25_MS)
#define SLAVE_LATENCY 0
#define CONN_SUP_TIMEOUT MSEC_TO_UNITS(4000, UNIT_10_MS)
#define FIRST_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(5000)
#define NEXT_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(30000)
#define MAX_CONN_PARAMS_UPDATE_COUNT 3
#define DEAD_BEEF 0xDEADBEEF
#define LARGO_ADVERTISING 0x18 // Largo_Advertising  10 son 16 y 18 son 24

uint8_t m_beacon_info[LARGO_ADVERTISING];

BLE_NUS_DEF(m_nus, NRF_SDH_BLE_TOTAL_LINK_COUNT);
NRF_BLE_QWR_DEF(m_qwr);
BLE_ADVERTISING_DEF(m_advertising);

static bool m_emisor_nus_ready = false;
static app_nus_server_on_data_received_t m_on_data_received = 0;
static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;
static uint16_t m_emisor_conn_handle = BLE_CONN_HANDLE_INVALID;
static uint8_t custom_mac_addr_[6] = {0};
static ble_gap_addr_t m_target_periph_addr;

static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};

// Función para realizar la recolección de basura
static void perform_garbage_collection(void)
{
    ret_code_t err_code = fds_gc();
    if (err_code == NRF_SUCCESS)
    {
        NRF_LOG_RAW_INFO("\n\t>> Recoleccion de basura completada.");
    }
    else
    {
        NRF_LOG_RAW_INFO("\n\t>> Error en la recoleccion de basura: %d", err_code);
    }
}

ret_code_t send_config_via_ble(void)
{
    ret_code_t ret;

    // Crear buffer con identificadores + configuración
    uint16_t config_size = sizeof(config_repeater_t);
    uint16_t total_size  = 2 + config_size; // 2 bytes identificadores + configuración
    uint8_t *buffer      = malloc(total_size);

    if (buffer == NULL)
    {
        NRF_LOG_RAW_INFO("\n[ERROR] No se pudo reservar memoria para el buffer");
        return NRF_ERROR_NO_MEM;
    }

    // Agregar identificadores al inicio
    buffer[0] = 0xCC;
    buffer[1] = 0xAA;

    // Copiar la estructura de configuración después de los identificadores
    memcpy(&buffer[2], &config_repeater, config_size);

    // Enviar via BLE NUS
    ret = app_nus_server_send_data(buffer, total_size);

    if (ret == NRF_SUCCESS)
    {
        NRF_LOG_RAW_INFO("\n[OK] Configuracion enviada via BLE con identificadores (%u bytes total)", total_size);

        // Mostrar los primeros bytes en log para debug
        NRF_LOG_RAW_INFO("\nPrimeros bytes: ");
        for (int i = 0; i < (total_size > 16 ? 16 : total_size); i++)
        {
            NRF_LOG_RAW_INFO("%02X ", buffer[i]);
        }
        if (total_size > 16)
        {
            NRF_LOG_RAW_INFO("... (%u bytes total)", total_size);
        }
        NRF_LOG_RAW_INFO("\n");
    }
    else
    {
        NRF_LOG_RAW_INFO("\n[ERROR] No se pudo enviar configuracion: 0x%X", ret);
    }

    // Liberar memoria
    free(buffer);

    // También mostrar en log local para debug
    NRF_LOG_RAW_INFO("\n--- CONFIGURACION ACTUAL ---");
    NRF_LOG_RAW_INFO("\nMAC Emisor: %02X:%02X:%02X:%02X:%02X:%02X",
                     config_repeater.mac_emisor[5], config_repeater.mac_emisor[4],
                     config_repeater.mac_emisor[3], config_repeater.mac_emisor[2],
                     config_repeater.mac_emisor[1], config_repeater.mac_emisor[0]);
    NRF_LOG_RAW_INFO("\nMAC Repetidor: %02X:%02X:%02X:%02X:%02X:%02X",
                     config_repeater.mac_repetidor[5], config_repeater.mac_repetidor[4],
                     config_repeater.mac_repetidor[3], config_repeater.mac_repetidor[2],
                     config_repeater.mac_repetidor[1], config_repeater.mac_repetidor[0]);
    NRF_LOG_RAW_INFO("\nTiempos: Activo=%ums, Sleep=%ums, Extendido=%ums",
                     config_repeater.tiempo_encendido, config_repeater.tiempo_dormido, config_repeater.tiempo_extendido);
    NRF_LOG_RAW_INFO("\nVersion: v%u.%u.%u",
                     config_repeater.version[0], config_repeater.version[1], config_repeater.version[2]);
    NRF_LOG_RAW_INFO("\nFecha Config: %02u/%02u/%u %02u:%02u:%02u",
                     config_repeater.fecha.day, config_repeater.fecha.month,
                     config_repeater.fecha.year, config_repeater.fecha.hour,
                     config_repeater.fecha.minute, config_repeater.fecha.second);
    NRF_LOG_RAW_INFO("\n--- FIN CONFIGURACION ---\n");
    NRF_LOG_FLUSH();

    return ret;
}


static void fds_evt_handler(fds_evt_t const *p_evt)
{
    if (p_evt->id == FDS_EVT_INIT)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\n\033[1;31m>\033[0m Iniciando el modulo de almacenamiento...\n");

            fds_stat_t stat = {0};
            fds_stat(&stat);
            NRF_LOG_RAW_INFO("\t>> Se encontraron %d registros validos.\n", stat.valid_records);
            NRF_LOG_RAW_INFO("\t>> Se encontraron %d registros no validos.", stat.dirty_records);

            if (stat.dirty_records > 0)
            {
                // Realiza la recolección de basura
                NRF_LOG_RAW_INFO("\n\t>> Limpiando registros no validos...");
                perform_garbage_collection();
            }
            NRF_LOG_RAW_INFO("\n\t>> \033[0;32mModulo inicializado correctamente.\033[0m");
        }
        else
        {
            NRF_LOG_RAW_INFO("\nError al inicializar FDS: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_WRITE)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\n\x1b[1;32m>> Registro escrito correctamente!\x1b[0m");
        }
        else
        {
            NRF_LOG_ERROR("Error al escribir el registro: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_UPDATE)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            // NRF_LOG_RAW_INFO(
            //     "\n\n\x1b[1;32m>>\x1b[0m Registro actualizado correctamente!");
        }
        else
        {
            NRF_LOG_ERROR("Error al actualizar el registro: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_DEL_RECORD)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\nRegistro eliminado correctamente.");
        }
        else
        {
            NRF_LOG_ERROR("Error al eliminar el registro: %d", p_evt->result);
        }
    }
    else if (p_evt->id == FDS_EVT_DEL_FILE)
    {
        if (p_evt->result == NRF_SUCCESS)
        {
            NRF_LOG_RAW_INFO("\nArchivo eliminado correctamente y todos los registros asociados.");
        }
        else
        {
            NRF_LOG_ERROR("Error al eliminar el archivo: %d", p_evt->result);
        }
    }
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may
 * need to inform the application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went
 * wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART
 * BLE Service and send it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t *p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

